//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт,
// какое число большее, а какое меньшее.


double a;
double b;

a = -9;
b = -3;

if (a>b)
{
Console.WriteLine("a=max b=min");
}
else
{
Console.WriteLine("b=max a=min");
}