//Напишите программу, которая на вход принимает число и выдаёт, 
//является ли число чётным (делится ли оно на два без остатка).

int number = 7;

if (number % 2 == 0 )
{
    Console.WriteLine("Да");
}
else
{
    Console.WriteLine("Нет");
} 