//Напишите программу, которая принимает на вход три числа
// и выдаёт максимальное из этих чисел.

double a;
double b;
double c;
double max;


a=44;
b=5;
c=78;
max=0;

if (a>b)
{
    if (a>c)
    {
    Console.WriteLine (max=a);
    }
    else
    {
    Console.WriteLine (max=c);
    }
}
else
{
    if (b>c)
    {
    Console.WriteLine (max=b);
    }
    else
    {
    Console.WriteLine(max=c);
    }
}